//Дано число больше 9. Вывести на экран  вторую цифру числа с конца

int a=38421;
int b=a/10;
int c=a/10%10;
System.Console.WriteLine(c);
