// Вывести на экран числа от -N до N

int i=-20;
int N=20;
while (i<=N)
{
    if (i<N)
    {
        System.Console.Write($"{i} ");
    }
    i++;
}